In [3]:
import pandas as pd
df=pd.read_csv('data.csv')
df

   S.No      Date  Temperature  Event  Windspeed
0     1  01/02/19           35   Snow          4
1     2  02/02/19           30   Rain          6
2     3  03/02/19           25  Sunny          8
3     4  04/02/19           20  Sunny         12
4     5  05/02/19           22   Rain         16
5     6  06/02/19           15   Snow         20

In [3]:
import pandas as pd
df=pd.read_excel('/home/faisalqureshi/Desktop/data1.xlsx','data')
df

   S.No      Date  Temperature  Event  Windspeed
0     1  01/02/19           35   Snow          4
1     2  02/02/19           30   Rain          6
2     3  03/02/19           25  Sunny          8
3     4  04/02/19           20  Sunny         12
4     5  05/02/19           22   Rain         16
5     6  06/02/19           15   Snow         20

In [4]:
whetherdata={
    'day':['Monday','Tuesday','Wednesday'],
    'temperature':[32,35,38],
    'windspead':[10,20,30],
    'event':['Rain','Sunny','Snow']
}
df=pd.DataFrame(whetherdata)
df

         day  temperature  windspead  event
0     Monday           32         10   Rain
1    Tuesday           35         20  Sunny
2  Wednesday           38         30   Snow

In [5]:
whetherdata=[
    ('Monday',32,10,'Rain'),
    ('Tuesday',35,20,'Sunny'),
    ('Wednesday',38,30,'Snow')
]
df=pd.DataFrame(whetherdata,columns=['day','temperature','windspead','event'])
df

         day  temperature  windspead  event
0     Monday           32         10   Rain
1    Tuesday           35         20  Sunny
2  Wednesday           38         30   Snow

In [6]:
whetherdata=[
    {'day':'Monday','temperature':32,'windspead':10,'event':'Rain'},
    {'day':'Monday','temperature':32,'windspead':20,'event':'Sunny'},
    {'day':'Monday','temperature':32,'windspead':20,'event':'Sunny'}
]
df=pd.DataFrame(whetherdata)
df

      day  temperature  windspead  event
0  Monday           32         10   Rain
1  Monday           32         20  Sunny
2  Monday           32         20  Sunny

In [7]:
import pandas as pd
df=pd.read_csv('/home/faisalqureshi/Desktop/Companydata.csv')
df

         Owner    Company        Revenue      Employees
0   Bill Gtaes  Microsoft           23B$            23K
1   Jeff Bezos     Amazon           30B$            25K
2    Elon Musk      Tesla  Not Available            20K
3  Mark Zucker   Facebook          20B$$           n.a.
4    Steve Job      Apple           22B$            12K
5   Larry Page     Google           n.a.  Not Available

In [8]:
import pandas as pd
df=pd.read_csv('/home/faisalqureshi/Desktop/Companydata.csv',nrows=3)
df

        Owner    Company        Revenue Employees
0  Bill Gtaes  Microsoft           23B$       23K
1  Jeff Bezos     Amazon           30B$       25K
2   Elon Musk      Tesla  Not Available       20K

In [9]:
df=pd.read_csv('/home/faisalqureshi/Desktop/Companydata.csv',na_values=['Not Available','n.a.'])
df

         Owner    Company Revenue Employees
0   Bill Gtaes  Microsoft    23B$       23K
1   Jeff Bezos     Amazon    30B$       25K
2    Elon Musk      Tesla     NaN       20K
3  Mark Zucker   Facebook   20B$$       NaN
4    Steve Job      Apple    22B$       12K
5   Larry Page     Google     NaN       NaN

In [10]:
df.to_csv('new.csv',index=False,columns=['Owner','Company'])

In [25]:
df_stock=pd.DataFrame({
    'Owner':['Bill Gates','Jeff Bezos','Elon Musk'],
    'Company':['Microsoft','Amazon','Tesl'],
    'Revenue':[23,30,25],
    'Employess':['23k','25k','20k']
    
})

df_whether=pd.DataFrame({
    'Date':['1/2/2021','2/2/2021','3/2/2021'],
    'Temperature':[30,35,40],
    'Event':['Snow','Rainy','Sunny']
})

In [26]:
with pd.ExcelWriter('Stock_whether.xlsx') as writer:
    df_stock.to_excel(writer,sheet_name='stock')
    df_whether.to_excel(writer,sheet_name='whether')